{"format": "graph-model", "generatedBy": "2.1.0", "convertedBy": "TensorFlow.js Converter v1.7.4r1", "userDefinedMetadata": {"signature": {"inputs": {"input_1:0": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "416"}, {"size": "416"}, {"size": "3"}]}}}, "outputs": {"Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}, {"size": "15"}]}}, "Identity_2:0": {"name": "Identity_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}, {"size": "15"}]}}, "Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}, {"size": "15"}]}}}}}, "modelTopology": {"node": [{"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "416"}, {"size": "416"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_1/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_1/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_2/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_2/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_3/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_4/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_4/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_5/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_5/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_6/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_6/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_7/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_7/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_8/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_8/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_9/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_9/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_10/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_10/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_11/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_11/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_12/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_12/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_13/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_13/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_16/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_16/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_14/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_14/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_17/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "768"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_17/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_18/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_18/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_21/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_21/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_19/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_19/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_22/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_22/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_23/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_23/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_24/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_24/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_15/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "45"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_15/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "45"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_strided_slice_22/strided_slice_22/begin", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_strided_slice_22/strided_slice_22/end", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_strided_slice_23/strided_slice_23/end", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_Reshape_2/shape/Reshape_2/shape/3", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_Reshape_2/shape/Reshape_2/shape/4", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_strided_slice_24/strided_slice_24/begin", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_strided_slice_24/strided_slice_24/end", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_strided_slice_24/strided_slice_24/strides", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_range_5/range_5/start", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_range_5/range_5/delta", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_strided_slice_29/strided_slice_29/begin", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_strided_slice_29/strided_slice_29/strides", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_strided_slice_30/strided_slice_30/begin", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_strided_slice_30/strided_slice_30/strides", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_concat_8/concat_8/axis", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_mul_6/mul_6/y", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_strided_slice_25/strided_slice_25/end", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_mul_7/mul_7", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_strided_slice_26/strided_slice_26/end", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/conv2d_25/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "45"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_20/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "45"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_25/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "45"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_20/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "45"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_resize/ResizeNearestNeighbor/resize/ResizeNearestNeighbor/size", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_resize_1/ResizeNearestNeighbor/resize_1/ResizeNearestNeighbor/size", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_mul/mul/y", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_mul_1/mul_1", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_mul_3/mul_3/y", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_mul_4/mul_4", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["input_1", "StatefulPartitionedCall/model/conv2d/Conv2D_weights", "StatefulPartitionedCall/model/conv2d/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "Func/StatefulPartitionedCall/output_control_node/_139", "op": "NoOp", "input": ["^StatefulPartitionedCall/model/conv2d_15/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_15/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_20/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_20/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_25/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/conv2d_25/Conv2D/ReadVariableOp"]}, {"name": "StatefulPartitionedCall/model/tf_op_layer_LeakyRelu/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model/batch_normalization/FusedBatchNormV3"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_1/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/tf_op_layer_LeakyRelu/LeakyRelu", "StatefulPartitionedCall/model/conv2d_1/Conv2D_weights", "StatefulPartitionedCall/model/conv2d_1/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_LeakyRelu_1/LeakyRelu_1", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model/batch_normalization_1/FusedBatchNormV3"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_2/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/tf_op_layer_LeakyRelu_1/LeakyRelu_1", "StatefulPartitionedCall/model/conv2d_2/Conv2D_weights", "StatefulPartitionedCall/model/conv2d_2/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_LeakyRelu_2/LeakyRelu_2", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model/batch_normalization_2/FusedBatchNormV3"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_3/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/tf_op_layer_LeakyRelu_2/LeakyRelu_2", "StatefulPartitionedCall/model/conv2d_3/Conv2D_weights", "StatefulPartitionedCall/model/conv2d_3/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_LeakyRelu_3/LeakyRelu_3", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model/batch_normalization_3/FusedBatchNormV3"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_4/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/tf_op_layer_LeakyRelu_3/LeakyRelu_3", "StatefulPartitionedCall/model/conv2d_4/Conv2D_weights", "StatefulPartitionedCall/model/conv2d_4/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_LeakyRelu_4/LeakyRelu_4", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model/batch_normalization_4/FusedBatchNormV3"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_5/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/tf_op_layer_LeakyRelu_4/LeakyRelu_4", "StatefulPartitionedCall/model/conv2d_5/Conv2D_weights", "StatefulPartitionedCall/model/conv2d_5/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_LeakyRelu_5/LeakyRelu_5", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model/batch_normalization_5/FusedBatchNormV3"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_6/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/tf_op_layer_LeakyRelu_5/LeakyRelu_5", "StatefulPartitionedCall/model/conv2d_6/Conv2D_weights", "StatefulPartitionedCall/model/conv2d_6/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_LeakyRelu_6/LeakyRelu_6", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model/batch_normalization_6/FusedBatchNormV3"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_7/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/tf_op_layer_LeakyRelu_6/LeakyRelu_6", "StatefulPartitionedCall/model/conv2d_7/Conv2D_weights", "StatefulPartitionedCall/model/conv2d_7/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_LeakyRelu_7/LeakyRelu_7", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model/batch_normalization_7/FusedBatchNormV3"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_8/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/tf_op_layer_LeakyRelu_7/LeakyRelu_7", "StatefulPartitionedCall/model/conv2d_8/Conv2D_weights", "StatefulPartitionedCall/model/conv2d_8/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_LeakyRelu_8/LeakyRelu_8", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model/batch_normalization_8/FusedBatchNormV3"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_9/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/tf_op_layer_LeakyRelu_8/LeakyRelu_8", "StatefulPartitionedCall/model/conv2d_9/Conv2D_weights", "StatefulPartitionedCall/model/conv2d_9/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_LeakyRelu_9/LeakyRelu_9", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model/batch_normalization_9/FusedBatchNormV3"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_10/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/tf_op_layer_LeakyRelu_9/LeakyRelu_9", "StatefulPartitionedCall/model/conv2d_10/Conv2D_weights", "StatefulPartitionedCall/model/conv2d_10/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_LeakyRelu_10/LeakyRelu_10", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model/batch_normalization_10/FusedBatchNormV3"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_11/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/tf_op_layer_LeakyRelu_10/LeakyRelu_10", "StatefulPartitionedCall/model/conv2d_11/Conv2D_weights", "StatefulPartitionedCall/model/conv2d_11/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_LeakyRelu_11/LeakyRelu_11", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model/batch_normalization_11/FusedBatchNormV3"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_12/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/tf_op_layer_LeakyRelu_11/LeakyRelu_11", "StatefulPartitionedCall/model/conv2d_12/Conv2D_weights", "StatefulPartitionedCall/model/conv2d_12/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_LeakyRelu_12/LeakyRelu_12", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model/batch_normalization_12/FusedBatchNormV3"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "StatefulPartitionedCall/model/average_pooling2d/AvgPool", "op": "AvgPool", "input": ["StatefulPartitionedCall/model/tf_op_layer_LeakyRelu_12/LeakyRelu_12"], "attr": {"ksize": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_13/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/average_pooling2d/AvgPool", "StatefulPartitionedCall/model/conv2d_13/Conv2D_weights", "StatefulPartitionedCall/model/conv2d_13/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_LeakyRelu_13/LeakyRelu_13", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model/batch_normalization_13/FusedBatchNormV3"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_15/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/tf_op_layer_LeakyRelu_13/LeakyRelu_13", "StatefulPartitionedCall/model/conv2d_16/Conv2D_weights", "StatefulPartitionedCall/model/conv2d_16/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_14/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/tf_op_layer_LeakyRelu_13/LeakyRelu_13", "StatefulPartitionedCall/model/conv2d_14/Conv2D_weights", "StatefulPartitionedCall/model/conv2d_14/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_LeakyRelu_15/LeakyRelu_15", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model/batch_normalization_15/FusedBatchNormV3"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_LeakyRelu_14/LeakyRelu_14", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model/batch_normalization_14/FusedBatchNormV3"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_resize/ResizeNearestNeighbor/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/model/tf_op_layer_LeakyRelu_15/LeakyRelu_15", "StatefulPartitionedCall/model/tf_op_layer_resize/ResizeNearestNeighbor/resize/ResizeNearestNeighbor/size"], "attr": {"_cloned": {"b": true}, "align_corners": {"b": false}, "half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_15/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/tf_op_layer_LeakyRelu_14/LeakyRelu_14", "StatefulPartitionedCall/model/conv2d_15/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model/conv2d_15/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_concat/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model/tf_op_layer_resize/ResizeNearestNeighbor/resize/ResizeNearestNeighbor", "StatefulPartitionedCall/model/tf_op_layer_LeakyRelu_10/LeakyRelu_10", "StatefulPartitionedCall/model/tf_op_layer_concat_8/concat_8/axis"], "attr": {"_cloned": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_Shape_2/Shape_2", "op": "Shape", "input": ["StatefulPartitionedCall/model/conv2d_15/BiasAdd"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_16/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/tf_op_layer_concat/concat", "StatefulPartitionedCall/model/conv2d_17/Conv2D_weights", "StatefulPartitionedCall/model/conv2d_17/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_strided_slice_22/strided_slice_22", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/tf_op_layer_Shape_2/Shape_2", "StatefulPartitionedCall/model/tf_op_layer_strided_slice_22/strided_slice_22/begin", "StatefulPartitionedCall/model/tf_op_layer_strided_slice_22/strided_slice_22/end", "StatefulPartitionedCall/model/tf_op_layer_strided_slice_22/strided_slice_22/end"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_strided_slice_23/strided_slice_23", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/tf_op_layer_Shape_2/Shape_2", "StatefulPartitionedCall/model/tf_op_layer_strided_slice_22/strided_slice_22/end", "StatefulPartitionedCall/model/tf_op_layer_strided_slice_23/strided_slice_23/end", "StatefulPartitionedCall/model/tf_op_layer_strided_slice_22/strided_slice_22/end"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_LeakyRelu_16/LeakyRelu_16", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model/batch_normalization_16/FusedBatchNormV3"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_Tile_8/multiples/Tile_8/multiples", "op": "Pack", "input": ["StatefulPartitionedCall/model/tf_op_layer_strided_slice_22/strided_slice_22", "StatefulPartitionedCall/model/tf_op_layer_range_5/range_5/delta", "StatefulPartitionedCall/model/tf_op_layer_range_5/range_5/delta", "StatefulPartitionedCall/model/tf_op_layer_Reshape_2/shape/Reshape_2/shape/3", "StatefulPartitionedCall/model/tf_op_layer_range_5/range_5/delta"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "5"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_Tile_6/multiples/Tile_6/multiples", "op": "Pack", "input": ["StatefulPartitionedCall/model/tf_op_layer_range_5/range_5/delta", "StatefulPartitionedCall/model/tf_op_layer_strided_slice_23/strided_slice_23"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_Reshape_2/shape/Reshape_2/shape", "op": "Pack", "input": ["StatefulPartitionedCall/model/tf_op_layer_strided_slice_22/strided_slice_22", "StatefulPartitionedCall/model/tf_op_layer_strided_slice_23/strided_slice_23", "StatefulPartitionedCall/model/tf_op_layer_strided_slice_23/strided_slice_23", "StatefulPartitionedCall/model/tf_op_layer_Reshape_2/shape/Reshape_2/shape/3", "StatefulPartitionedCall/model/tf_op_layer_Reshape_2/shape/Reshape_2/shape/4"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "5"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_range_5/range_5", "op": "Range", "input": ["StatefulPartitionedCall/model/tf_op_layer_range_5/range_5/start", "StatefulPartitionedCall/model/tf_op_layer_strided_slice_23/strided_slice_23", "StatefulPartitionedCall/model/tf_op_layer_range_5/range_5/delta"], "attr": {"_cloned": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_Tile_7/multiples/Tile_7/multiples", "op": "Pack", "input": ["StatefulPartitionedCall/model/tf_op_layer_strided_slice_23/strided_slice_23", "StatefulPartitionedCall/model/tf_op_layer_range_5/range_5/delta"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_17/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/tf_op_layer_LeakyRelu_16/LeakyRelu_16", "StatefulPartitionedCall/model/conv2d_18/Conv2D_weights", "StatefulPartitionedCall/model/conv2d_18/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_Reshape_2/Reshape_2", "op": "Reshape", "input": ["StatefulPartitionedCall/model/conv2d_15/BiasAdd", "StatefulPartitionedCall/model/tf_op_layer_Reshape_2/shape/Reshape_2/shape"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_strided_slice_29/strided_slice_29", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/tf_op_layer_range_5/range_5", "StatefulPartitionedCall/model/tf_op_layer_strided_slice_29/strided_slice_29/begin", "StatefulPartitionedCall/model/tf_op_layer_strided_slice_29/strided_slice_29/begin", "StatefulPartitionedCall/model/tf_op_layer_strided_slice_29/strided_slice_29/strides"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "2"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "1"}, "end_mask": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_strided_slice_28/strided_slice_28", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/tf_op_layer_range_5/range_5", "StatefulPartitionedCall/model/tf_op_layer_strided_slice_29/strided_slice_29/begin", "StatefulPartitionedCall/model/tf_op_layer_strided_slice_29/strided_slice_29/begin", "StatefulPartitionedCall/model/tf_op_layer_strided_slice_29/strided_slice_29/strides"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "2"}, "end_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_LeakyRelu_17/LeakyRelu_17", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model/batch_normalization_17/FusedBatchNormV3"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.10000000149011612}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_strided_slice_24/strided_slice_24", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/tf_op_layer_Reshape_2/Reshape_2", "StatefulPartitionedCall/model/tf_op_layer_strided_slice_24/strided_slice_24/begin", "StatefulPartitionedCall/model/tf_op_layer_strided_slice_24/strided_slice_24/end", "StatefulPartitionedCall/model/tf_op_layer_strided_slice_24/strided_slice_24/strides"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "15"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "15"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_strided_slice_25/strided_slice_25", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/tf_op_layer_Reshape_2/Reshape_2", "StatefulPartitionedCall/model/tf_op_layer_strided_slice_24/strided_slice_24/end", "StatefulPartitionedCall/model/tf_op_layer_strided_slice_25/strided_slice_25/end", "StatefulPartitionedCall/model/tf_op_layer_strided_slice_24/strided_slice_24/strides"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "15"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "15"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_strided_slice_26/strided_slice_26", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/tf_op_layer_Reshape_2/Reshape_2", "StatefulPartitionedCall/model/tf_op_layer_strided_slice_25/strided_slice_25/end", "StatefulPartitionedCall/model/tf_op_layer_strided_slice_26/strided_slice_26/end", "StatefulPartitionedCall/model/tf_op_layer_strided_slice_24/strided_slice_24/strides"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "15"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "15"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_strided_slice_27/strided_slice_27", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/tf_op_layer_Reshape_2/Reshape_2", "StatefulPartitionedCall/model/tf_op_layer_strided_slice_26/strided_slice_26/end", "StatefulPartitionedCall/model/tf_op_layer_strided_slice_24/strided_slice_24/begin", "StatefulPartitionedCall/model/tf_op_layer_strided_slice_24/strided_slice_24/strides"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "15"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "31"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_Tile_7/Tile_7", "op": "Tile", "input": ["StatefulPartitionedCall/model/tf_op_layer_strided_slice_29/strided_slice_29", "StatefulPartitionedCall/model/tf_op_layer_Tile_7/multiples/Tile_7/multiples"], "attr": {"_cloned": {"b": true}, "Tmultiples": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_Tile_6/Tile_6", "op": "Tile", "input": ["StatefulPartitionedCall/model/tf_op_layer_strided_slice_28/strided_slice_28", "StatefulPartitionedCall/model/tf_op_layer_Tile_6/multiples/Tile_6/multiples"], "attr": {"_cloned": {"b": true}, "Tmultiples": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_19/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/tf_op_layer_LeakyRelu_17/LeakyRelu_17", "StatefulPartitionedCall/model/conv2d_21/Conv2D_weights", "StatefulPartitionedCall/model/conv2d_21/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_18/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/tf_op_layer_LeakyRelu_17/LeakyRelu_17", "StatefulPartitionedCall/model/conv2d_19/Conv2D_weights", "StatefulPartitionedCall/model/conv2d_19/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model/tf_op_layer_Sigmoid_6/Sigmoid_6", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/tf_op_layer_strided_slice_24/strided_slice_24"], "attr": {"_cloned": {"b": true}, "T": 